In [2]:
import pandas as pd
data_fl = pd.read_csv("FL_insurance_sample.csv")
data_fl

,policyID,statecode,county,eq_site_limit,hu_site_limit,fl_site_limit,fr_site_limit,tiv_2011,tiv_2012,eq_site_deductible,hu_site_deductible,fl_site_deductible,fr_site_deductible,point_latitude,point_longitude,line,construction,point_granularity
0,119736,FL,CLAY COUNTY,498960.0,498960.00,498960.0,498960.0,498960.00,792148.90,0.0,9979.2,0.0,0,30.102261,-81.711777,Residential,Masonry,1
1,448094,FL,CLAY COUNTY,1322376.3,1322376.30,1322376.3,1322376.3,1322376.30,1438163.57,0.0,0.0,0.0,0,30.063936,-81.707664,Residential,Masonry,3
2,206893,FL,CLAY COUNTY,190724.4,190724.40,190724.4,190724.4,190724.40,192476.78,0.0,0.0,0.0,0,30.089579,-81.700455,Residential,Wood,1
3,333743,FL,CLAY COUNTY,0.0,79520.76,0.0,0.0,79520.76,86854.48,0.0,0.0,0.0,0,30.063236,-81.707703,Residential,Wood,3
4,172534,FL,CLAY COUNTY,0.0,254281.50,0.0,254281.5,254281.50,246144.49,0.0,0.0,0.0,0,30.060614,-81.702675,Residential,Wood,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36629,404309,FL,PINELLAS COUNTY,0.0,88722.00,0.0,88722.0,88722.00,155065.65,0.0,0.0,0.0,0,28.122885,-82.770218,Residential,Wood,3
36630,465875,FL,PINELLAS COUNTY,1297057.5,1297057.50,1297057.5,1297057.5,1297057.50,1577500.79,0.0,0.0,0.0,0,28.080900,-82.758800,Residential,Masonry,1
36631,791209,FL,PINELLAS COUNTY,173286.9,173286.90,0.0,0.0,173286.90,205527.97,0.0,0.0,0.0,0,28.110550,-82.766360,Residential,Wood,4
36632,322627,FL,PINELLAS COUNTY,1499781.6,1499781.60,0.0,0.0,1499781.60,1768782.43,0.0,0.0,0.0,0,28.089415,-82.697411,Residential,Masonry,3
36633,398149,FL,PINELLAS COUNTY,373488.3,373488.30,0.0,0.0,373488.30,596003.67,0.0,0.0,0.0,0,28.064440,-82.774590,Residential,Masonry,1

In [3]:
#row with index 1 and all columns
data_fl.iloc[1,:]

policyID                   448094
statecode                      FL
county                CLAY COUNTY
eq_site_limit         1.32238e+06
hu_site_limit         1.32238e+06
fl_site_limit         1.32238e+06
fr_site_limit         1.32238e+06
tiv_2011              1.32238e+06
tiv_2012              1.43816e+06
eq_site_deductible              0
hu_site_deductible              0
fl_site_deductible              0
fr_site_deductible              0
point_latitude            30.0639
point_longitude          -81.7077
line                  Residential
construction              Masonry
point_granularity               3
Name: 1, dtype: object

In [6]:
data_fl.columns

Index(['policyID', 'statecode', 'county', 'eq_site_limit', 'hu_site_limit',
       'fl_site_limit', 'fr_site_limit', 'tiv_2011', 'tiv_2012',
       'eq_site_deductible', 'hu_site_deductible', 'fl_site_deductible',
       'fr_site_deductible', 'point_latitude', 'point_longitude', 'line',
       'construction', 'point_granularity'],
      dtype='object')

In [7]:
data_fl.loc[1,'policyID':'point_granularity']

policyID                   448094
statecode                      FL
county                CLAY COUNTY
eq_site_limit         1.32238e+06
hu_site_limit         1.32238e+06
fl_site_limit         1.32238e+06
fr_site_limit         1.32238e+06
tiv_2011              1.32238e+06
tiv_2012              1.43816e+06
eq_site_deductible              0
hu_site_deductible              0
fl_site_deductible              0
fr_site_deductible              0
point_latitude            30.0639
point_longitude          -81.7077
line                  Residential
construction              Masonry
point_granularity               3
Name: 1, dtype: object

In [8]:
# row with index 1 and column with index 1
data_fl.iloc[1,1]

'FL'

In [13]:
data_fl.loc[1,'statecode']

'FL'

In [14]:
# row with index 1 and columns with index 1,2
data_fl.iloc[1,1:3]

statecode             FL
county       CLAY COUNTY
Name: 1, dtype: object

In [16]:
data_fl.loc[1,'policyID':'county']

policyID          448094
statecode             FL
county       CLAY COUNTY
Name: 1, dtype: object

In [27]:
data_fl[['county']] #its a dataframe

                county
0          CLAY COUNTY
1          CLAY COUNTY
2          CLAY COUNTY
3          CLAY COUNTY
4          CLAY COUNTY
...                ...
36629  PINELLAS COUNTY
36630  PINELLAS COUNTY
36631  PINELLAS COUNTY
36632  PINELLAS COUNTY
36633  PINELLAS COUNTY

[36634 rows x 1 columns]

In [26]:
data_fl['county'] #its a series

0            CLAY COUNTY
1            CLAY COUNTY
2            CLAY COUNTY
3            CLAY COUNTY
4            CLAY COUNTY
              ...
36629    PINELLAS COUNTY
36630    PINELLAS COUNTY
36631    PINELLAS COUNTY
36632    PINELLAS COUNTY
36633    PINELLAS COUNTY
Name: county, Length: 36634, dtype: object

In [30]:
# Access row with index 133 as a series
data_fl.iloc[133]

policyID                        482457
statecode                           FL
county                ST  JOHNS COUNTY
eq_site_limit                        0
hu_site_limit                   159042
fl_site_limit                        0
fr_site_limit                        0
tiv_2011                        159042
tiv_2012                        249985
eq_site_deductible                   0
hu_site_deductible                   0
fl_site_deductible                   0
fr_site_deductible                   0
point_latitude                 29.7766
point_longitude               -81.4717
line                       Residential
construction                      Wood
point_granularity                    1
Name: 133, dtype: object

In [31]:
# Access row with index 133 as a dataframe
data_fl.iloc[[133]]

,policyID,statecode,county,eq_site_limit,hu_site_limit,fl_site_limit,fr_site_limit,tiv_2011,tiv_2012,eq_site_deductible,hu_site_deductible,fl_site_deductible,fr_site_deductible,point_latitude,point_longitude,line,construction,point_granularity
133,482457,FL,ST JOHNS COUNTY,0.0,159041.52,0.0,0.0,159041.52,249984.64,0.0,0.0,0.0,0,29.776566,-81.47171,Residential,Wood,1

In [32]:
data_fl.iloc[133:134]

,policyID,statecode,county,eq_site_limit,hu_site_limit,fl_site_limit,fr_site_limit,tiv_2011,tiv_2012,eq_site_deductible,hu_site_deductible,fl_site_deductible,fr_site_deductible,point_latitude,point_longitude,line,construction,point_granularity
133,482457,FL,ST JOHNS COUNTY,0.0,159041.52,0.0,0.0,159041.52,249984.64,0.0,0.0,0.0,0,29.776566,-81.47171,Residential,Wood,1

In [33]:
data_fl.county.isnull()

0        False
1        False
2        False
3        False
4        False
         ...
36629    False
36630    False
36631    False
36632    False
36633    False
Name: county, Length: 36634, dtype: bool

In [35]:
data_fl.county.isna()

0        False
1        False
2        False
3        False
4        False
         ...
36629    False
36630    False
36631    False
36632    False
36633    False
Name: county, Length: 36634, dtype: bool

In [68]:
data_sample = pd.read_csv("sample.csv",names=['Names','salary','year'])
data_sample

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      NaN  2019

In [45]:
data_sample.isnull()

   Names  salary   year
0  False   False  False
1  False   False  False
2  False   False  False
3  False    True  False

In [46]:
data_sample.isna()

   Names  salary   year
0  False   False  False
1  False   False  False
2  False   False  False
3  False    True  False

In [47]:
data_sample.isnull().sum() #default axis=0(column)

Names     0
salary    1
year      0
dtype: int64

In [48]:
data_sample.isnull().sum(axis=1) #row wise

0    0
1    0
2    0
3    1
dtype: int64

In [49]:
data_sample.loc[data_sample.salary.isna()]

             Names  salary  year
3  Revanth Sundarm     NaN  2019

#### To remove the columns

In [50]:
data_sample.drop("salary",axis=1) #inplace=True will overwrite the original column

             Names  year
0       RajAcharya  2015
1      SaiTeja Ram  2012
2    Hemendra Arya  2018
3  Revanth Sundarm  2019

In [51]:
data_sample

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      NaN  2019

In [52]:
data_sample.drop(["salary","year"],axis=1)

             Names
0       RajAcharya
1      SaiTeja Ram
2    Hemendra Arya
3  Revanth Sundarm

#### To remove rows

In [56]:
data_sample.drop(index=[1,2])

             Names   salary  year
0       RajAcharya  45000.0  2015
3  Revanth Sundarm      NaN  2019

In [55]:
data_sample.drop([0,1],axis=0)

             Names   salary  year
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      NaN  2019

In [57]:
data_sample.drop(3,axis=0)

           Names   salary  year
0     RajAcharya  45000.0  2015
1    SaiTeja Ram  78000.0  2012
2  Hemendra Arya  32000.0  2018

#### To remove rows with missing values

In [58]:
data_sample.dropna() #removes row with missing value

           Names   salary  year
0     RajAcharya  45000.0  2015
1    SaiTeja Ram  78000.0  2012
2  Hemendra Arya  32000.0  2018

In [59]:
#removes the column with missing value
data_sample.dropna(axis=1)

             Names  year
0       RajAcharya  2015
1      SaiTeja Ram  2012
2    Hemendra Arya  2018
3  Revanth Sundarm  2019

#### To fill the missing value with 0

In [60]:
data_sample.fillna(0)

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      0.0  2019

In [61]:
data_sample.salary = data_sample.salary.fillna(0)# overwrites the original
#data_sample.salary.fillna(0)

In [64]:
data_sample

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      0.0  2019

#### Fill the missing value with mean

In [67]:
m = data_sample.salary.mean()
print(m)
data_sample.salary.fillna(m)

51666.666666666664

0    45000.000000
1    78000.000000
2    32000.000000
3    51666.666667
Name: salary, dtype: float64

In [70]:
#total missing value count
data_sample.isnull().sum().sum()

1

In [71]:
#missing values in a specific column
data_sample.salary.isnull().sum()

1

In [72]:
samplecopy = data_sample.copy()
samplecopy

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      NaN  2019

In [73]:
dummy = samplecopy.copy()

In [74]:
dummy

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      NaN  2019

In [75]:
dummy.salary = dummy.salary.mean()

In [76]:
dummy

             Names        salary  year
0       RajAcharya  51666.666667  2015
1      SaiTeja Ram  51666.666667  2012
2    Hemendra Arya  51666.666667  2018
3  Revanth Sundarm  51666.666667  2019

#### creating dummy columns(one-hot encoding)

In [78]:
s = pd.Series(['avg','good','bad','excellent','avg','good'])
pd.get_dummies(s) # create dummy columns with unique columns

   avg  bad  excellent  good
0    1    0          0     0
1    0    0          0     1
2    0    1          0     0
3    0    0          1     0
4    1    0          0     0
5    0    0          0     1

In [79]:
s.nunique()

4

In [80]:
s.unique()

array(['avg', 'good', 'bad', 'excellent'], dtype=object)

In [81]:
data_sample

             Names   salary  year
0       RajAcharya  45000.0  2015
1      SaiTeja Ram  78000.0  2012
2    Hemendra Arya  32000.0  2018
3  Revanth Sundarm      NaN  2019

In [82]:
pd.get_dummies(data_sample)

,salary,year,Names_Hemendra Arya,Names_RajAcharya,Names_Revanth Sundarm,Names_SaiTeja Ram
0,45000.0,2015,0,1,0,0
1,78000.0,2012,0,0,0,1
2,32000.0,2018,1,0,0,0
3,NaN,2019,0,0,1,0

In [83]:
data_sample.dtypes==object

Names      True
salary    False
year      False
dtype: bool

In [85]:
data_fl.loc[:,data_fl.dtypes==object].nunique()

statecode        1
county          67
line             2
construction     5
dtype: int64

In [86]:
data_fl.loc[:,data_fl.dtypes==object].nunique().sum()

75

In [87]:
cat_columns_count = (data_fl.dtypes==object).sum()

In [88]:
cat_columns_count

4

In [90]:
#75
pd.get_dummies(data_fl).shape[1]

89